# -*- coding: utf-8 -*-


mail = {
    'sender': 'watch_ch@163.com',
    'host': 'smtp.163.com',
    'password': 'ch20103314',
    'subject_prefix': '豆瓣爬虫租房',
    'receivers': ['chenhe2018@qq.com', '859789528@qq.com'],
}

groups = [
    (634832, '天之骄子'),
    (496399, '【广兰路附近租房】'),
    ('zjhouse', '浦东张江租房'),
    (609867, '个人张江租房'),
    (642507, '上海张江租房'),
    (583132, '上海无中介租房'),
    (558815, '上海租房@女生合租 QQ小窝318367415'),
    ('shanghaizufang', '上海租房'),
    (633599, '上海租房-浦东租房|上海浦东租房'),
    (580888, '浦东张江周边租房'),
]

# 搜索关键字
locations = ['天之骄子']

# 不包括
exclude_words = ('求租', '香楠', '玉兰', '金科路', '张江高科', '求', '短租', '已出', '13', '申城', '整租', '已转租')

# 预设时间节点，仅看此后数据
pre_time = '2021-06-01 00:00:00'

# 范围时间
range_time_start = '9:00'
range_time_end = '23:30'
